charliejgallo/ESP32S3_AmoledOS/apps/radio/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ELF_LOADER=y
# project_so() solo define el target 'so' si esta habilitado el soporte de
# objetos compartidos, tambien del lado de la app.
CONFIG_ELF_DYNAMIC_LOAD_SHARED_OBJECT=y
# La app no linkea LVGL, pero necesita que los headers declaren las mismas
# fuentes que tiene el firmware.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
